# Lab | Data Aggregation and Filtering

In this challenge, we will continue to work with customer data from an insurance company. We will use the dataset called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by first performing data cleaning, formatting, and structuring.

1. Create a new DataFrame that only includes customers who have a total_claim_amount greater than $1,000 and have a response of "Yes" to the last marketing campaign.

2. Using the original Dataframe, analyze the average total_claim_amount by each policy type and gender for customers who have responded "Yes" to the last marketing campaign. Write your conclusions.

3. Analyze the total number of customers who have policies in each state, and then filter the results to only include states where there are more than 500 customers.

4. Find the maximum, minimum, and median customer lifetime value by education level and gender. Write your conclusions.

In [24]:
import pandas as pd

df = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis.csv")
df.head()

,Unnamed: 0,Customer,State,Customer Lifetime Value,Response,Coverage,Education,Effective To Date,EmploymentStatus,Gender,...,Number of Open Complaints,Number of Policies,Policy Type,Policy,Renew Offer Type,Sales Channel,Total Claim Amount,Vehicle Class,Vehicle Size,Vehicle Type
0,0,DK49336,Arizona,4809.216960,No,Basic,College,2/18/11,Employed,M,...,0.0,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,NaN
1,1,KX64629,California,2228.525238,No,Basic,College,1/18/11,Unemployed,F,...,0.0,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,NaN
2,2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2/10/11,Employed,M,...,0.0,2,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A
3,3,XL78013,Oregon,22332.439460,Yes,Extended,College,1/11/11,Employed,M,...,0.0,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A
4,4,QA50777,Oregon,9025.067525,No,Premium,Bachelor,1/17/11,Medical Leave,F,...,NaN,7,Personal Auto,Personal L2,Offer1,Branch,707.925645,Four-Door Car,Medsize,NaN

In [27]:
#1

new_df = df[(df["Total Claim Amount"] >1000.00) & (df["Response"] == "Yes") ]
new_df.head()

,Unnamed: 0,Customer,State,Customer Lifetime Value,Response,Coverage,Education,Effective To Date,EmploymentStatus,Gender,...,Number of Open Complaints,Number of Policies,Policy Type,Policy,Renew Offer Type,Sales Channel,Total Claim Amount,Vehicle Class,Vehicle Size,Vehicle Type
189,189,OK31456,California,11009.130490,Yes,Premium,Bachelor,1/24/11,Employed,F,...,0.0,1,Corporate Auto,Corporate L3,Offer2,Agent,1358.400000,Luxury Car,Medsize,NaN
236,236,YJ16163,Oregon,11009.130490,Yes,Premium,Bachelor,1/24/11,Employed,F,...,0.0,1,Special Auto,Special L3,Offer2,Agent,1358.400000,Luxury Car,Medsize,A
419,419,GW43195,Oregon,25807.063000,Yes,Extended,College,2/13/11,Employed,F,...,1.0,2,Personal Auto,Personal L2,Offer1,Branch,1027.200000,Luxury Car,Small,A
442,442,IP94270,Arizona,13736.132500,Yes,Premium,Master,2/13/11,Disabled,F,...,0.0,8,Personal Auto,Personal L2,Offer1,Web,1261.319869,SUV,Medsize,A
587,587,FJ28407,California,5619.689084,Yes,Premium,High School or Below,1/26/11,Unemployed,M,...,0.0,1,Personal Auto,Personal L1,Offer2,Web,1027.000029,SUV,Medsize,A

In [29]:
#2
response = df[df["Response"]== "Yes"]

grouped = response.groupby(["Policy Type", "Gender"]).agg({"Total Claim Amount":"mean"}).reset_index()
grouped

      Policy Type Gender  Total Claim Amount
0  Corporate Auto      F          433.738499
1  Corporate Auto      M          408.582459
2   Personal Auto      F          452.965929
3   Personal Auto      M          457.010178
4    Special Auto      F          453.280164
5    Special Auto      M          429.527942

In [57]:
#3

customer_state = df["State"].value_counts().reset_index()
customer_state.columns = ["State", "Customer Count"]
customer_state_500=customer_state[customer_state ["Customer Count"] >500]
customer_state_500

        State  Customer Count
0  California            3552
1      Oregon            2909
2     Arizona            1937
3      Nevada             993
4  Washington             888

In [45]:
#4

df_grouped = df.groupby(["Education", "Gender"]).agg({"Customer Lifetime Value": ["max", "min", "mean"]}).reset_index()
df_grouped

              Education Gender Customer Lifetime Value               \
                                                   max          min
0              Bachelor      F             73225.95652  1904.000852
1              Bachelor      M             67907.27050  1898.007675
2               College      F             61850.18803  1898.683686
3               College      M             61134.68307  1918.119700
4                Doctor      F             44856.11397  2395.570000
5                Doctor      M             32677.34284  2267.604038
6  High School or Below      F             55277.44589  2144.921535
7  High School or Below      M             83325.38119  1940.981221
8                Master      F             51016.06704  2417.777032
9                Master      M             50568.25912  2272.307310


          mean
0  7874.269478
1  7703.601675
2  7748.823325
3  8052.459288
4  7328.508916
5  7415.333638
6  8675.220201
7  8149.687783
8  8157.053154
9  8168.832659

## Bonus

5. The marketing team wants to analyze the number of policies sold by state and month. Present the data in a table where the months are arranged as columns and the states are arranged as rows.

6.  Display a new DataFrame that contains the number of policies sold by month, by state, for the top 3 states with the highest number of policies sold.

*Hint:*
- *To accomplish this, you will first need to group the data by state and month, then count the number of policies sold for each group. Afterwards, you will need to sort the data by the count of policies sold in descending order.*
- *Next, you will select the top 3 states with the highest number of policies sold.*
- *Finally, you will create a new DataFrame that contains the number of policies sold by month for each of the top 3 states.*

7. The marketing team wants to analyze the effect of different marketing channels on the customer response rate.

Hint: You can use melt to unpivot the data and create a table that shows the customer response rate (those who responded "Yes") by marketing channel.

External Resources for Data Filtering: https://towardsdatascience.com/filtering-data-frames-in-pandas-b570b1f834b9

In [47]:
#5
df["Effective To Date"] = pd.to_datetime(df["Effective To Date"])
df["Month"] = df["Effective To Date"].dt.month
df.head()

/var/folders/7d/57z_mx2n1qs9p9s3y806bc4h0000gq/T/ipykernel_49769/3903581825.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df["Effective To Date"] = pd.to_datetime(df["Effective To Date"])

,Unnamed: 0,Customer,State,Customer Lifetime Value,Response,Coverage,Education,Effective To Date,EmploymentStatus,Gender,...,Number of Policies,Policy Type,Policy,Renew Offer Type,Sales Channel,Total Claim Amount,Vehicle Class,Vehicle Size,Vehicle Type,Month
0,0,DK49336,Arizona,4809.216960,No,Basic,College,2011-02-18,Employed,M,...,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,NaN,2
1,1,KX64629,California,2228.525238,No,Basic,College,2011-01-18,Unemployed,F,...,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,NaN,1
2,2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2011-02-10,Employed,M,...,2,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A,2
3,3,XL78013,Oregon,22332.439460,Yes,Extended,College,2011-01-11,Employed,M,...,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A,1
4,4,QA50777,Oregon,9025.067525,No,Premium,Bachelor,2011-01-17,Medical Leave,F,...,7,Personal Auto,Personal L2,Offer1,Branch,707.925645,Four-Door Car,Medsize,NaN,1

In [52]:
policies_state_month = df.pivot_table(values = "Policy", index = "State", columns = "Month", aggfunc = "count")
policies_state_month

Month          1     2
State
Arizona     1008   929
California  1918  1634
Nevada       551   442
Oregon      1565  1344
Washington   463   425

In [67]:
#6
policies_state_month = df.groupby(["State", "Month"]).agg({"Policy":"count"}).reset_index()
policies_state_month.columns = ['State', 'Month', 'Number of Policies']
policies_state_month

        State  Month  Number of Policies
0     Arizona      1                1008
1     Arizona      2                 929
2  California      1                1918
3  California      2                1634
4      Nevada      1                 551
5      Nevada      2                 442
6      Oregon      1                1565
7      Oregon      2                1344
8  Washington      1                 463
9  Washington      2                 425

In [76]:
total_policies_state = policies_state_month.groupby("State")["Number of Policies"].sum().reset_index()
total_policies_state_sorted =total_policies_state.sort_values(by="Number of Policies", ascending=False)
top_3 = total_policies_state_sorted.head(3)["State"].tolist()
top_3_policies = policies_state_month[policies_state_month["State"].isin(top_3)]
pivot_table_top_3 = top_3_policies.pivot_table(index="State", values="Number of Policies", columns = "Month", aggfunc ="sum")
pivot_table_top_3

Month          1     2
State
Arizona     1008   929
California  1918  1634
Oregon      1565  1344

In [83]:
#7
melted_df = df.melt(id_vars= ["Response", "Sales Channel"], value_vars=[], var_name="variable", value_name="value")
melted_df.head()

Empty DataFrame
Columns: [Response, Sales Channel, variable, value]
Index: []

In [87]:
total_cust_channel = df["Sales Channel"].value_counts().reset_index()
total_cust_channel.columns = ["Sales Channel", "Total Customers"]

responses_yes = df[df["Response"] == "Yes"]["Sales Channel"].value_counts().reset_index()
responses_yes.columns=["Sales Channel", "responses_yes"]

response_rates = pd.merge(total_cust_channel, responses_yes, on="Sales Channel")
response_rates["response_rates"] = (response_rates["responses_yes"]/response_rates["Total Customers"])*100
response_rates

  Sales Channel  Total Customers  responses_yes  response_rates
0         Agent             4121            742       18.005339
1        Branch             3022            326       10.787558
2   Call Center             2141            221       10.322279
3           Web             1626            177       10.885609